In [1]:
# pandas - creating series
import pandas as pd
s1 = pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [2]:
s2 = pd.Series([1,2,3,4], index = ['A','B','C','D'])
s2

A    1
B    2
C    3
D    4
dtype: int64

In [3]:
df = pd.DataFrame({'foo': ['x','y','z'],
                  'bar': [6,10,None],
                  'baz': [True, True, False]})
df

  foo   bar    baz
0   x   6.0   True
1   y  10.0   True
2   z   NaN  False

In [4]:
df['foo']

0    x
1    y
2    z
Name: foo, dtype: object

In [5]:
df.loc[0:2]

  foo   bar    baz
0   x   6.0   True
1   y  10.0   True
2   z   NaN  False

In [6]:
df[ (df['baz']) ]

  foo   bar   baz
0   x   6.0  True
1   y  10.0  True

In [7]:
df[ (df['foo'] == 'x') |
  (df['foo'] == 'z') ]

  foo  bar    baz
0   x  6.0   True
2   z  NaN  False

In [8]:
new_df = df.dropna()
new_df

  foo   bar   baz
0   x   6.0  True
1   y  10.0  True

In [9]:
new_df = df.dropna(how = 'all')
new_df

  foo   bar    baz
0   x   6.0   True
1   y  10.0   True
2   z   NaN  False

In [10]:
new_df = df.fillna(2)
new_df

  foo   bar    baz
0   x   6.0   True
1   y  10.0   True
2   z   2.0  False

In [11]:
new_df = df.fillna(method = 'ffill')
new_df

  foo   bar    baz
0   x   6.0   True
1   y  10.0   True
2   z  10.0  False

In [12]:
new_df = df.fillna(method = 'ffill', limit = 1)
new_df

  foo   bar    baz
0   x   6.0   True
1   y  10.0   True
2   z  10.0  False

In [13]:
ix = df.index
ix

RangeIndex(start=0, stop=3, step=1)

In [14]:
df.set_index([['one', 'one', 'two',], df.index])

      foo   bar    baz
one 0   x   6.0   True
    1   y  10.0   True
two 2   z   NaN  False

In [15]:
df.T

        0     1      2
foo     x     y      z
bar   6.0  10.0    NaN
baz  True  True  False